-------------------------------------------------------------------------
-- Author: Mega Show
-- Date: 2016.10.26 10:08
-- Name: 毕达哥拉斯三元组函数的定义
-------------------------------------------------------------------------

module MyTriads where

--函数triads,返回数值不大于n的所有的毕达哥拉斯三元组，三元组有序
triads :: Int -> [(Int, Int, Int)]
triads n = [(a,b,c) | a<-[1..n], b<-[1..n], c<-[1..n], a^2+b^2==c^2]

--函数triads2,返回数值不大于n的所有的毕达哥拉斯三元组，三元组无序，唯一
triads2 :: Int -> [(Int, Int, Int)]
triads2 n = [(a,b,c) | a<-[1..n], b<-[1..n], c<-[1..n], a<b, a^2+b^2==c^2]
